LonelyWolf/stm32/stm32l151rdt6-dev/main.c
	// nRF24 SPI port initialization
	SPIx_Init(nRF24_SPI_PORT);
	SPIx_SetSpeed(nRF24_SPI_PORT,SPI_BR_2); // Highest speed (16MHz with 32MHz CPU)

	// Initialize and configure nRF24
	nRF24_Init();
	j = nRF24_Check();
	printf("nRF24L01+: %s\r\n",(j) ? "PRESENT" : "FAIL");

	// Dump nRF24L01+ registers
	if (j) {
		printf("nRF24L01+ registers:\r\n");
		for (i = 0; i < 0x1d; i++) {
			j = nRF24_ReadReg(i);
			printf("R%02X=0x%02X%s",i,j,((i + 1) % 8) ? " " : "\r\n");
		}

		// Configure nRF24 IRQ EXTI line
		EXTI->PR    =  nRF24_IRQ_EXTI; // Clear IT pending bit for EXTI
		EXTI->IMR  |=  nRF24_IRQ_EXTI; // Enable interrupt request from EXTI
		EXTI->EMR  &= ~nRF24_IRQ_EXTI; // Disable event on EXTI
		EXTI->RTSR &= ~nRF24_IRQ_EXTI; // Trigger rising edge disabled
		EXTI->FTSR |=  nRF24_IRQ_EXTI; // Trigger falling edge enabled

		// PB1 as source input for EXTI1
		SYSCFG->EXTICR[0] &= ~SYSCFG_EXTICR1_EXTI1; // Clear bits (PA[x] pin as input source)
		SYSCFG->EXTICR[0] |=  SYSCFG_EXTICR1_EXTI1_PB; // Set PB[x] pin as input source

		SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOB,EXTI_PinSource1);

/*
		// Enable the nRF24 IRQ pin interrupt
		NVICInit.NVIC_IRQChannel = nRF24_IRQ_EXTI_N;
		NVICInit.NVIC_IRQChannelPreemptionPriority = 2;
		NVICInit.NVIC_IRQChannelSubPriority = 0;
		NVICInit.NVIC_IRQChannelCmd = ENABLE;
		NVIC_Init(&NVICInit);
*/

		// Simple enable the nRF24 IRQ pin interrupt
		NVIC_EnableIRQ(nRF24_IRQ_EXTI_N);

		// Configure nRF24 receive mode
		nRF24_Wake();
#ifdef NRF24_SOLAR
		// Solar powered temperature sensor
		nRF24_RXMode(
				nRF24_RX_PIPE0,           // RX on PIPE#0
				nRF24_ENAA_P0,            // Auto acknowledgment enabled for PIPE#0
				nRF24_RF_CHANNEL,         // RF Channel
				nRF24_DataRate_1Mbps,     // Data rate
				nRF24_CRC_2byte,          // CRC scheme
				(uint8_t *)nRF24_RX_Addr, // RX address
				nRF24_RX_Addr_Size,       // RX address size
				nRF24_RX_PAYLOAD,         // Payload length
				nRF24_TXPower_0dBm        // TX power for auto acknowledgment
				);
#else
		// WBC
		nRF24_RXMode(
				nRF24_RX_PIPE0,           // RX on PIPE#0
				nRF24_ENAA_OFF,           // Auto acknowledgment
				nRF24_RF_CHANNEL,         // RF Channel
				nRF24_DataRate_250kbps,   // Data rate
				nRF24_CRC_2byte,          // CRC scheme
				(uint8_t *)nRF24_RX_Addr, // RX address
				nRF24_RX_Addr_Size,       // RX address size
				nRF24_RX_PAYLOAD,         // Payload length
				nRF24_TXPower_0dBm        // TX power for auto acknowledgment
				);
#endif
	    nRF24_ClearIRQFlags();
	    nRF24_FlushRX();

	    printf("\r\n---------------------------------------------\r\n");
	}




	// Check Vbat measurement

	// Enable the PORTA peripheral
	RCC->AHBENR |= RCC_AHBPeriph_GPIOA;

	// Configure PA1 as analog (for ADC_IN1)
	GPIOA->MODER |=  GPIO_MODER_MODER1; // Analog mode

	// Enable Vbat divider
	PWR_VBAT_ENABLE_H(); // Turn on

	// Initialize the HSI clock
	RCC->CR |= RCC_CR_HSION; // Enable HSI
	while (!(RCC->CR & RCC_CR_HSIRDY)); // Wait until HSI stable

	// Initialize the ADC
	RCC->APB2ENR |= RCC_APB2ENR_ADC1EN; // Enable the ADC1 peripheral clock
	ADC->CCR = ADC_CCR_TSVREFE; // Enable Vrefint and temperature sensor, ADC prescaler = HSI/1
	while(!(PWR->CSR & PWR_CSR_VREFINTRDYF)); // Wait until Vrefint stable

	// Configure the ADC
	ADC1->CR1 &= ~ADC_CR1_RES; // 12-bit resolution (Tconv = 12 ADCCLK cycles)
	ADC1->CR1 |= ADC_CR1_SCAN | ADC_CR1_PDI; // Scan mode, power down during the idle phase
	ADC1->CR2 &= ~ADC_CR2_ALIGN; // Right alignment

	// ADC channels sample rate
	ADC1->SMPR3 |= ADC_SMPR3_SMP1; // Channel 1: 384 cycles
	ADC1->SMPR2 |= ADC_SMPR2_SMP17; // Channel 17: 384 cycles

	// Injected sequence (2 conversions: first ADC_IN1, then ADC_IN17)
	ADC1->JSQR = ADC_JSQR_JL_0 | ADC_JSQR_JSQ3_0 | ADC_JSQR_JSQ4_0 | ADC_JSQR_JSQ4_4;

	// Enable the ADC
	ADC1->CR2 |= ADC_CR2_ADON;
	while (!(ADC1->SR & ADC_SR_ADONS)); // Wait until ADC is on




	// Initialize the I2C peripheral
	if (I2Cx_Init(I2C1,400000) != I2C_SUCCESS) {
		printf("I2C initialization failed\r\n");
		SleepStandby();
	}



	// Check the ALS
	TSL2581_Init();
	TSL2581_SetGain(TSL2581_GAIN8);
	d0 = TSL2581_GetData0();
	d1 = TSL2581_GetData1();
//	TSL2581_PowerOff();



	// Check the BMP180
    BMP180_Reset(); // Send reset command to BMP180
    Delay_ms(15); // Wait for BMP180 startup time (10ms by datasheet)
	if (BMP180_Check() == BMP180_SUCCESS) {
		BMP180_ReadCalibration();
		BR = BMP180_GetReadings(&RT,&RP,BMP180_ADVRES);
	}




	// Check the BMC050
	BMC050_ACC_SoftReset();
	Delay_ms(5); // must wait for start-up time of accelerometer (2ms)
	BMC050_Init();

	// Enable I2C watchdog timer with 50ms
	BMC050_ACC_InterfaceConfig(ACC_IF_WDT_50ms);

	BMC050_ACC_SetBandwidth(ACC_BW8); // Accelerometer readings filtering (lower or higher better?)
	BMC050_ACC_SetIRQMode(ACC_IM_NOLATCH); // No IRQ latching
	BMC050_ACC_ConfigSlopeIRQ(0,8); // Motion detection sensitivity
	BMC050_ACC_IntPinMap(ACC_IM1_SLOPE); // Map slope interrupt to INT1 pin
	BMC050_ACC_SetIRQ(ACC_IE_SLOPEX | ACC_IE_SLOPEY | ACC_IE_SLOPEZ); // Detect motion by all axes
	BMC050_ACC_LowPower(ACC_SLEEP_1000); // Low power with sleep duration 1s
//	BMC050_ACC_LowPower(ACC_SLEEP_1); // Low power with sleep duration 1ms

//	BMC050_ACC_Suspend();




	PWR_SD_ENABLE_H(); // Turn SD on

	// Enable the DMA2 peripheral clock
	RCC->AHBENR |= RCC_AHBENR_DMA2EN;

	// Enable the DMA2 channel4 interrupt
//	NVIC_EnableIRQ(DMA2_Channel4_IRQn);

	// Enable the SDIO interrupt
//	NVIC_EnableIRQ(SDIO_IRQn);

//	if (!(SD_DETECT_PORT->IDR & SD_DETECT_PIN)) {
	if (_SD_connected) {
		SD_SDIO_GPIO_Init();
		j = SD_Init();
		printf("SD_Init: %X\r\n",j);
	} else j = SDR_NoResponse;

	if (j == SDR_Success) {
		if (SDCard.Type != SDCT_MMC) {
			// MMC doesn't support 4-bit bus
			if (SDCard.SCR[1] & 0x05) {
				// Set 4-bit bus width
				SD_SetBusWidth(SD_BUS_4BIT);
			}
		}

		// DMA read block test
		for (i = 0; i < 2048; i++) sector[i] = '#';
		i = 2048; // block size
		j = SD_ReadBlock_DMA(0,(uint32_t *)sector,i);
		printf("SD_ReadBlock_DMA = %X\r\n",j);
		if (j == SDR_Success) {
			// Wait till data transfered by DMA
			j = SD_CheckRead(i);
			printf("SD_CheckRead = %X\r\n",j);
//			if (j == SDR_Success) VCP_SendBufPrintable(sector,i,'.');
//			printf("\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n");
		}

